package ex1_variable_practice;

public class PracticeExample {

	public static void main(String[] args) {

		/*
		* 과수원이 있다. * 
		* 배, 사과, 오렌지를 키우고 있는데 하루에 생산되는 양은 각각
		* 5, 7, 5개. * 
		* 과수원에서 하루에 생산되는 총 개수를 출력하고, 시간당 
		* 전체 과일의 평균 생산 갯수를 출력. * 평균값을 담는 변수는 float으로 할 것. */

		// 연습문제.
		// 짝수 : 2로 나눈 나머지 값이 0인 수 
		// 홀수 : 2로 나눈 나머지 값이 1인 수

		
		
		//  3의 배수 : 3으로 나눈 나머지 값이 0인 수

		
		
		// 변수 age에 나이를 대입하고, 30세 이상이면... “드실만큼 드셨네요”, 
		// 그렇지 않으면 “더 드세요”를 출력하는 if문을 구현 한 후
		// 마지막으로 “감사합니다”라는 문장을 출력해보자.
		
		// 점수 0점 미만, 100점 초과 제외, 90이상 수 80이상 우 70이상 미 60이상 양 나머지 가

		// 통장에서 돈 빼기
		// 100 -> 200 -> 300 (한 번에 100원씩 늘려가며 통장에서 돈을 뺄 때 몇 번을 뺄 것인가)
		
		int bank = 100000;
		int money = 100;
		while (bank >= money) {
		System.out.println(bank + "원은 은행에 있는 돈이고" + money + "는 내가 뺄 돈이다.");
		bank -= money;
		money += 100;}
		System.out.println("통장 잔고는 " + bank + "원 이고" + "내가 뺄 돈은 " +money + "원 이다.");
		
		// 연습문제.
		// 변수 start부터 변수 stop사이 모든 정수 출력
		
		
		
		
		
		
		
		
	}
}


